chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx570f512l.h
PLIB_INLINE_API void PLIB_USB_EPnTxEnable(USB_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnTxEnable_PIC32(index, endpoint);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnTxDisable(USB_MODULE_ID index, uint8_t endpoint)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnTxDisable_PIC32(index, endpoint);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnHandshakeEnable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnHandshakeEnable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnHandshakeDisable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnHandshakeDisable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnControlTransferEnable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnControlTransferEnable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnControlTransferDisable(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnControlTransferDisable_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnAttributesSet(USB_MODULE_ID index, uint8_t epValue, int direction, bool isControl, bool handshake)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnAttributesSet_PIC32(index, epValue, direction, isControl, handshake);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnDirectionDisable(USB_MODULE_ID index, uint8_t epValue, int direction)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnDirectionDisable_PIC32(index, epValue, direction);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnAttributesClear(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnAttributesClear_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_EPnIsStalled(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            return USB_EPnIsStalled_PIC32(index, epValue);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_EPnStallClear(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_ID_1 :
            USB_EPnStallClear_PIC32(index, epValue);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_EP0HostSetup(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_EP0HostSetup_PIC32(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsEPnRxEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsEPnRxEnable_PIC32(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void* PLIB_USB_BufferAddressGet(USB_MODULE_ID index, void* pBDT, USB_PING_PONG_MODE ppMode, uint8_t epValue, USB_BUFFER_DIRECTION bufferDirection, USB_BUFFER_PING_PONG bufferPingPong)
{
    switch (index) {
        case USB_ID_1 :
            return USB_BufferAddressGet_PIC32(index, pBDT, ppMode, epValue, bufferDirection, bufferPingPong);
        case USB_NUMBER_OF_MODULES :
        default :
            return (void*)0;
    }
}

PLIB_INLINE_API void PLIB_USB_BufferAddressSet(USB_MODULE_ID index, void* pBDT, USB_PING_PONG_MODE ppMode, uint8_t epValue, USB_BUFFER_DIRECTION bufferDirection, USB_BUFFER_PING_PONG bufferPingPong, void* bufferAddress)
{
    switch (index) {
        case USB_ID_1 :
            USB_BufferAddressSet_PIC32(index, pBDT, ppMode, epValue, bufferDirection, bufferPingPong, bufferAddress);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint16_t PLIB_USB_BufferByteCountGet(USB_MODULE_ID index, void* pBDT, USB_PING_PONG_MODE ppMode, uint8_t epValue, USB_BUFFER_DIRECTION bufferDirection, USB_BUFFER_PING_PONG bufferPingPong)
{
    switch (index) {
        case USB_ID_1 :
            return USB_BufferByteCountGet_PIC32(index, pBDT, ppMode, epValue, bufferDirection, bufferPingPong);
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API void PLIB_USB_BufferByteCountSet(USB_MODULE_ID index, void* pBDT, USB_PING_PONG_MODE ppMode, uint8_t epValue, USB_BUFFER_DIRECTION bufferDirection, USB_BUFFER_PING_PONG bufferPingPong, uint16_t bufferByteCount)
{
    switch (index) {
        case USB_ID_1 :
            USB_BufferByteCountSet_PIC32(index, pBDT, ppMode, epValue, bufferDirection, bufferPingPong, bufferByteCount);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_BufferCancelReleaseToUSB(USB_MODULE_ID index, void* pBDT, USB_PING_PONG_MODE ppMode, uint8_t epValue, USB_BUFFER_DIRECTION bufferDirection, USB_BUFFER_PING_PONG bufferPingPong)
{
    switch (index) {
        case USB_ID_1 :
            USB_BufferCancelReleaseToUSB_PIC32(index, pBDT, ppMode, epValue, bufferDirection, bufferPingPong);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

